# Advanced Querying Mongo

Importing libraries and setting up connection

In [4]:
from pymongo import MongoClient

import warnings
warnings.filterwarnings('ignore')

cursor=MongoClient('mongodb://localhost:27017') #genera la forma de poder movernos dentro del database

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [24]:
cursor.list_database_names() #nos indica donde estamos, en la raiz, y vemos las diferentes DB

['admin', 'companies', 'config', 'local']

In [25]:
db =cursor.companies # entramos dentro de la database companies por capas, primera.

In [41]:
colec = db.companies # segunda capa accedemos a los datos de las columnas, es asi simplemente.

In [62]:
list(colec.find().limit(1)) #encontramos el primera fila, para ver que funciona y estamos donde toca

[{'_id': ObjectId('52cdef7c4bab8bd675297d8a'),
  'name': 'Wetpaint',
  'permalink': 'abc2',
  'crunchbase_url': 'http://www.crunchbase.com/company/wetpaint',
  'homepage_url': 'http://wetpaint-inc.com',
  'blog_url': 'http://digitalquarters.net/',
  'blog_feed_url': 'http://digitalquarters.net/feed/',
  'twitter_username': 'BachelrWetpaint',
  'category_code': 'web',
  'number_of_employees': 47,
  'founded_year': 2005,
  'founded_month': 10,
  'founded_day': 17,
  'deadpooled_year': 1,
  'tag_list': 'wiki, seattle, elowitz, media-industry, media-platform, social-distribution-system',
  'alias_list': '',
  'email_address': 'info@wetpaint.com',
  'phone_number': '206.859.6300',
  'description': 'Technology Platform Company',
  'created_at': datetime.datetime(2007, 5, 25, 6, 51, 27),
  'updated_at': 'Sun Dec 08 07:15:44 UTC 2013',
  'overview': '<p>Wetpaint is a technology platform company that uses its proprietary state-of-the-art technology and expertise in social media to build and monetize audiences for digital publishers. Wetpaint’s own online property, Wetpaint Entertainment, an entertainment news site that attracts more than 12 million unique visitors monthly and has over 2 million Facebook fans, is a proof point to the company’s success in building and engaging audiences. Media companies can license Wetpaint’s platform which includes a dynamic playbook tailored to their individual needs and comprehensive training. Founded by Internet pioneer Ben Elowitz, and with offices in New York and Seattle, Wetpaint is backed by Accel Partners, the investors behind Facebook.</p>',
  'image': {'available_sizes': [[[150, 75],
     'assets/images/resized/0000/3604/3604v14-max-150x150.jpg'],
    [[250, 125], 'assets/images/resized/0000/3604/3604v14-max-250x250.jpg'],
    [[450, 225], 'assets/images/resized/0000/3604/3604v14-max-450x450.jpg']]},
  'products': [{'name': 'Wikison Wetpaint', 'permalink': 'wetpaint-wiki'},
   {'name': 'Wetpaint Social Distribution System',
    'permalink': 'wetpaint-social-distribution-system'}],
  'relationships': [{'is_past': False,
    'title': 'Co-Founder and VP, Social and Audience Development',
    'person': {'first_name': 'Michael',
     'last_name': 'Howell',
     'permalink': 'michael-howell'}},
   {'is_past': False,
    'title': 'Co-Founder/CEO/Board of Directors',
    'person': {'first_name': 'Ben',
     'last_name': 'Elowitz',
     'permalink': 'ben-elowitz'}},
   {'is_past': False,
    'title': 'COO/Board of Directors',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': False,
    'title': 'SVP, Strategy and Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Theresia',
     'last_name': 'Ranzetta',
     'permalink': 'theresia-ranzetta'}},
   {'is_past': False,
    'title': 'Board Member',
    'person': {'first_name': 'Gus',
     'last_name': 'Tai',
     'permalink': 'gus-tai'}},
   {'is_past': False,
    'title': 'Board',
    'person': {'first_name': 'Len',
     'last_name': 'Jordan',
     'permalink': 'len-jordan'}},
   {'is_past': False,
    'title': 'Head of Technology and Product',
    'person': {'first_name': 'Alex',
     'last_name': 'Weinstein',
     'permalink': 'alex-weinstein'}},
   {'is_past': True,
    'title': 'CFO',
    'person': {'first_name': 'Bert',
     'last_name': 'Hogue',
     'permalink': 'bert-hogue'}},
   {'is_past': True,
    'title': 'CFO/ CRO',
    'person': {'first_name': 'Brian',
     'last_name': 'Watkins',
     'permalink': 'brian-watkins'}},
   {'is_past': True,
    'title': 'Senior Vice President, Marketing',
    'person': {'first_name': 'Rob',
     'last_name': 'Grady',
     'permalink': 'rob-grady'}},
   {'is_past': True,
    'title': 'VP, Technology and Product',
    'person': {'first_name': 'Werner',
     'last_name': 'Koepf',
     'permalink': 'werner-koepf'}},
   {'is_past': True,
    'title': 'VP Marketing',
    'person': {'first_name': 'Kevin',
     'last_name': 'Flaherty',
     'permalink': 'kevin-flaherty'}},
   {'is_past': True,
    'title': 'VP User Experience',
    'person': {'first_name': 'Alex',
     'last_name': 'Berg',
     'permalink': 'alex-berg'}},
   {'is_past': True,
    'title': 'VP Engineering',
    'person': {'first_name': 'Steve',
     'last_name': 'McQuade',
     'permalink': 'steve-mcquade'}},
   {'is_past': True,
    'title': 'Executive Editor',
    'person': {'first_name': 'Susan',
     'last_name': 'Mulcahy',
     'permalink': 'susan-mulcahy'}},
   {'is_past': True,
    'title': 'VP Business Development',
    'person': {'first_name': 'Chris',
     'last_name': 'Kollas',
     'permalink': 'chris-kollas'}}],
  'competitions': [{'competitor': {'name': 'Wikia', 'permalink': 'wikia'}},
   {'competitor': {'name': 'JotSpot', 'permalink': 'jotspot'}},
   {'competitor': {'name': 'Socialtext', 'permalink': 'socialtext'}},
   {'competitor': {'name': 'Ning by Glam Media', 'permalink': 'ning'}},
   {'competitor': {'name': 'Soceeo', 'permalink': 'soceeo'}},
   {'competitor': {'name': 'Yola', 'permalink': 'yola'}},
   {'competitor': {'name': 'SocialGO', 'permalink': 'socialgo'}},
   {'competitor': {'name': 'IslamNor', 'permalink': 'islamnor'}}],
  'providerships': [],
  'total_money_raised': '$39.8M',
  'funding_rounds': [{'id': 888,
    'round_code': 'a',
    'source_url': 'http://seattlepi.nwsource.com/business/246734_wiki02.html',
    'source_description': '',
    'raised_amount': 5250000,
    'raised_currency_code': 'USD',
    'funded_year': 2005,
    'funded_month': 10,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 889,
    'round_code': 'b',
    'source_url': 'http://pulse2.com/2007/01/09/wiki-builder-website-wetpaint-welcomes-95m-funding/',
    'source_description': '',
    'raised_amount': 9500000,
    'raised_currency_code': 'USD',
    'funded_year': 2007,
    'funded_month': 1,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None}]},
   {'id': 2312,
    'round_code': 'c',
    'source_url': 'http://www.accel.com/news/news_one_up.php?news_id=185',
    'source_description': 'Accel',
    'raised_amount': 25000000,
    'raised_currency_code': 'USD',
    'funded_year': 2008,
    'funded_month': 5,
    'funded_day': 19,
    'investments': [{'company': None,
      'financial_org': {'name': 'DAG Ventures', 'permalink': 'dag-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Accel Partners',
       'permalink': 'accel-partners'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Trinity Ventures',
       'permalink': 'trinity-ventures'},
      'person': None},
     {'company': None,
      'financial_org': {'name': 'Frazier Technology Ventures',
       'permalink': 'frazier-technology-ventures'},
      'person': None}]}],
  'investments': [],
  'acquisition': {'price_amount': 30000000,
   'price_currency_code': 'USD',
   'term_code': 'cash_and_stock',
   'source_url': 'http://allthingsd.com/20131216/viggle-tries-to-bulk-up-its-social-tv-business-by-buying-wetpaint/?mod=atdtweet',
   'source_description': ' Viggle Tries to Bulk Up Its Social TV Business by Buying Wetpaint',
   'acquired_year': 2013,
   'acquired_month': 12,
   'acquired_day': 16,
   'acquiring_company': {'name': 'Viggle', 'permalink': 'viggle'}},
  'acquisitions': [],
  'offices': [{'description': '',
    'address1': '710 - 2nd Avenue',
    'address2': 'Suite 1100',
    'zip_code': '98104',
    'city': 'Seattle',
    'state_code': 'WA',
    'country_code': 'USA',
    'latitude': 47.603122,
    'longitude': -122.333253},
   {'description': '',
    'address1': '270 Lafayette Street',
    'address2': 'Suite 505',
    'zip_code': '10012',
    'city': 'New York',
    'state_code': 'NY',
    'country_code': 'USA',
    'latitude': 40.7237306,
    'longitude': -73.9964312}],
  'milestones': [{'id': 5869,
    'description': "Wetpaint named in Lead411's Hottest Seattle Companies list",
    'stoned_year': 2010,
    'stoned_month': 6,
    'stoned_day': 8,
    'source_url': 'http://www.lead411.com/seattle-companies.html',
    'source_text': None,
    'source_description': 'LEAD411 LAUNCHES "HOTTEST SEATTLE COMPANIES" AWARDS',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}},
   {'id': 8702,
    'description': 'Site-Builder Wetpaint Makes One For Itself, Using the Demand Media Playbook',
    'stoned_year': 2010,
    'stoned_month': 9,
    'stoned_day': 6,
    'source_url': 'http://mediamemo.allthingsd.com/20100906/site-builder-wetpaint-makes-one-for-itself-using-the-demand-media-playbook/',
    'source_text': None,
    'source_description': 'All Things D',
    'stoneable_type': 'Company',
    'stoned_value': None,
    'stoned_value_type': None,
    'stoned_acquirer': None,
    'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}],
  'video_embeds': [],
  'screenshots': [{'available_sizes': [[[150, 86],
      'assets/images/resized/0016/0929/160929v2-max-150x150.png'],
     [[250, 143], 'assets/images/resized/0016/0929/160929v2-max-250x250.png'],
     [[450, 258], 'assets/images/resized/0016/0929/160929v2-max-450x450.png']],
    'attribution': None}],
  'external_links': [{'external_url': 'http://www.geekwire.com/2011/rewind-ben-elowitz-wetpaint-ceo-building-type-media-company',
    'title': 'GeekWire interview: Rewind - Ben Elowitz, Wetpaint CEO, on building a new type of media company'},
   {'external_url': 'http://techcrunch.com/2012/06/17/search-and-social-how-two-will-soon-become-one/',
    'title': 'Guest post by CEO Ben Elowitz in TechCrunch'},
   {'external_url': 'http://allthingsd.com/20120516/what-to-expect-when-facebook-is-expecting-five-predictions-for-facebooks-first-public-year/',
    'title': 'Guest post by CEO Ben Elowitz in AllThingsD'},
   {'external_url': 'http://adage.com/article/digitalnext/facebook-biggest-player-advertising-s-540-billion-world/235708/',
    'title': 'Guest post by CEO Ben Elowitz in AdAge'},
   {'external_url': 'http://www.businessinsider.com/facebook-captures-14-percent-of-our-online-attention-but-only-4-percent-of-ad-spending-online-2012-6',
    'title': 'Guest post by CEO Ben Elowitz in Business Insider'},
   {'external_url': 'http://allfacebook.com/wetpaint-media-data_b75963',
    'title': 'AllFacebook coverage of Wetpaint'},
   {'external_url': 'http://adage.com/article/digital/celeb-site-wetpaint-shows-media-profit-facebook/237828/',
    'title': 'Profile of Wetpaint in Ad Age'},
   {'external_url': 'http://allthingsd.com/20121018/how-to-boost-your-facebook-traffic-tips-and-tricks-from-wetpaint/',
    'title': 'Interview with Wetpaint CEO Ben Elowitz in All Things D'},
   {'external_url': 'http://www.xconomy.com/seattle/2012/10/19/wetpaint-starts-licensing-its-facebook-based-media-distribution-tech/',
    'title': 'Profile of Wetpaint in Xconomy'}],
  'partners': []}]

In [75]:
import pandas as pd

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [73]:
df=pd.DataFrame(list(colec.find({'name':'Babelgum'},
                
                {'_id':False, 'name':True }).limit(3)))

df

       name
0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [78]:
# Your Code -- combinamos y sale to bonito
df2= pd.DataFrame(list(colec.find({'number_of_employees': {'$gte':5000}},{'_id':False, 'name':True, 'number_of_employees': True }).sort('number_of_employees', 1).limit(20)))
df2

                             name  number_of_employees
0        JDS Uniphase Corporation                 5000
1                 United Internet                 5000
2             Air Astana Airlines                 5000
3               Vcare Call Center                 5000
4                          McAfee                 5000
5                         Spotify                 5000
6               PCH International                 5000
7                        Nintendo                 5080
8           Hexaware Technologies                 5200
9                        Facebook                 5299
10                       OpenText                 5300
11                     CPM Braxis                 5400
12                            LSI                 5400
13         Microchip Technologies                 5500
14                       Mediaset                 5729
15  Mindray Medical International                 5763
16                          Baidu                 6000
17                          Atmel                 6000
18            Tata Communications                 6000
19                         Dentsu                 6000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [90]:
# Your Code -- combinamos , considerar el $and y que al ser una nueva key, hay que cerrarla como tal, y dentro de esa agruparlas por `[ una lista]`
df2= pd.DataFrame(list(colec.find({ '$and': 

                                [{'founded_year': {'$gt': 2000}},
                                
                                 {'founded_year': {'$lt': 2005}}]},


{'_id':False, 'name':True, 'founded_year': True }).limit(20)))

df2

              name  founded_year
0             Digg          2004
1         Facebook          2004
2      StumbleUpon          2002
3           Gizmoz          2003
4            Plaxo          2002
5       Technorati          2002
6          AddThis          2004
7             Veoh          2004
8           Meetup          2002
9          SmugMug          2002
10           Skype          2003
11  Pando Networks          2004
12            Ikan          2003
13       delicious          2003
14           Topix          2002
15         Jobster          2004
16        AllPeers          2004
17        iContact          2003
18          blinkx          2004
19            Yelp          2004

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [93]:
# Your Code
df2= pd.DataFrame(list(colec.find({ '$and': 

                                [{'ipo.valuation_amount': {'$gte': 100000000}},
                                
                                 {'founded_year': {'$lte': 2010}}]},


{'_id':False, 'name':True, 'total_money_raised': True }).limit(20)))
df2

              name total_money_raised
0         Facebook             $2.43B
1          Twitter             $1.16B
2             Yelp               $90M
3         LinkedIn              $200M
4           Amazon                $8M
5       Brightcove              $103M
6      KIT digital               $20M
7          Nielsen                 $0
8        OpenTable               $48M
9   ChannelAdvisor               $75M
10   Jive Software             $69.4M
11          Zillow             $96.6M
12             Wix             $58.5M
13      Shutterfly                 $0
14     TripAdvisor                 $0
15      Salesforce             $99.9M
16        HomeAway              $504M
17      QuinStreet                $4k
18       Rackspace                 $0
19    BMC Software                 $0

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [100]:
# Your Code
df2= pd.DataFrame(list(colec.find({ '$and': 

                                [{'number_of_employees': {'$lte': 1000}},
                                
                                 {'founded_year': {'$lte': 2005}}]},


{'_id':False, 'name':True, 'number_of_employees': True }).sort('number_of_employees', -1).limit(10)))

df2

                         name  number_of_employees
0                    Omniture                 1000
1                     Telenav                 1000
2                     Gumtree                 1000
3  SK Net Service Company Ltd                 1000
4                       Yodle                 1000
5                    OC'LIANE                 1000
6      FANUC Robotics America                 1000
7         Antal International                 1000
8              Sonus Networks                 1000
9         Akamai Technologies                 1000

### 6. All the companies that don't include the `partners` field.

In [107]:
# Your Code
df2= pd.DataFrame(list(colec.find({'partners': None}))),


df2

Empty DataFrame
Columns: []
Index: []

### 7. All the companies that have a null type of value on the `category_code` field.

In [108]:
# Your Code
df2= pd.DataFrame(list(colec.find({'category_code': None },

{'_id':False, 'name':True, 'category_code': True }).sort('number_of_employees', -1).limit(10)))

df2

                                         name category_code
0  Nippon Telegraph and Telephone Corporation          None
1                   Flextronics International          None
2               Digital Equipment Corporation          None
3                             Cox Enterprises          None
4                                  ExxonMobil          None
5                               Guitar Center          None
6                   American Power Conversion          None
7                                 Gottschalks          None
8                                     GoDaddy          None
9                                   Advantest          None

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [106]:
# Your Code
df2= pd.DataFrame(list(colec.find({ '$and': 

                                [{'number_of_employees': {'$gte': 100}},
                                
                                 {'number_of_employees': {'$lt': 1000}}]},


{'_id':False, 'name':True, 'number_of_employees': True }).sort('number_of_employees', -1).limit(10)))

df2

                              name  number_of_employees
0                      Datamonitor                  984
1             Infinera Corporation                  974
2                              Box                  950
3  NorthPoint Communications Group                  948
4                     888 Holdings                  931
5               Forrester Research                  903
6          Relax Solutions Pvt Ltd                  900
7                       Webmetrics                  900
8                        SonicWALL                  900
9                           InMobi                  900

### 9. Order all the companies by their IPO price in a descending order.

In [123]:
# Your Code, 

# Your Code, con el json normailze se queda la columna limpia sin el diccionario, deforma que es mejor que cuando usamos json files, usemos el json normalize
# que es lo mismo que el DataFrame pero para json files. desenreda los diccionarios.


df2= pd.json_normalize(list(colec.find({'ipo.valuation_amount':{'$gte': 0}},


{'_id':False, 'name':True, 'ipo.valuation_amount': True }).sort('ipo.valuation_amount', -1).limit(10)))

df2

              name  ipo.valuation_amount
0             GREE          108960000000
1         Facebook          104000000000
2           Amazon          100000000000
3          Twitter           18100000000
4          Groupon           12800000000
5          Tencent           11000000000
6  Western Digital            9430000000
7         LinkedIn            9310000000
8     BMC Software            6000000000
9        Rackspace            5440000000

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [124]:
df2= pd.json_normalize(list(colec.find({'number_of_employees':{'$gte': 0}},


{'_id':False, 'name':True, 'number_of_employees': True }).sort('number_of_employees', -1).limit(10)))

df2

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [127]:
# Your Code

df2= pd.json_normalize(list(colec.find({'founded_month': {'$gte': 6}},
                                
                                


{'_id':False, 'name':True, 'founded_month': True }).limit(1000)))

df2

            name  founded_month
0       Wetpaint             10
1           Zoho              9
2           Digg             10
3      Omnidrive             11
4        Postini              6
..           ...            ...
995     Openfilm             11
996        uCubd              9
997      MyGreat              7
998  SquareClock             12
999  MyPronostic              8

[1000 rows x 2 columns]

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [130]:
# Your Code

df2= pd.json_normalize(list(colec.find({ '$and': 

                                [{'founded_year': {'$lte': 2000}},
                                
                                 {'acquisition.price_amount': {'$gte': 1000000}}]},


{'_id':False, 'name':True, 'founded_year': True, 'acquisition.price_amount': True }).sort('acquisition.price_amount', -1).limit(10)))

df2

                           name  founded_year  acquisition.price_amount
0                   BEA Systems          1995                8500000000
1                        Navteq          1985                8100000000
2                         Pixar          1986                7400000000
3              Sun Microsystems          1982                7400000000
4                           LSI          1980                6600000000
5        National Semiconductor          1959                6500000000
6                     aQuantive          1997                6400000000
7                Siebel Systems          1993                5850000000
8                        Sybase          1984                5800000000
9  Affiliated Computer Services          1988                5750000000

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [132]:
# Your Code

df2= pd.json_normalize(list(colec.find(

                                {'founded_year': {'$gte': 2010}},
                                
                                

{'_id':False, 'name':True, 'acquisition.price_amount': True }).sort('acquisition.price_amount', -1).limit(10)))

df2

        name  acquisition.price_amount
0    Magento               180000000.0
1      Fixya                       NaN
2    PeekYou                       NaN
3      Wamba                       NaN
4  Widgetbox                       NaN
5     Pinger                       NaN
6      headr                       NaN
7   Mokitown                       NaN
8   CircleUp                       NaN
9      GENWI                       NaN

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [139]:
# Your Code

df2= pd.json_normalize(list(colec.find({'founded_year': {'$ne': 0}},
                                

{'_id':False, 'name':True, 'founded_year': True }).sort('founded_year', -1)))

df2

                      name  founded_year
0                    Fixya        2013.0
1                    Wamba        2013.0
2                Advaliant        2013.0
3                     Fluc        2013.0
4                   iBazar        2013.0
...                    ...           ...
18796            Embedster           NaN
18797        Willdan Group           NaN
18798             Geekdive           NaN
18799          goBookmaker           NaN
18800  EnteGreat Solutions           NaN

[18801 rows x 2 columns]

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [141]:
# Your Code

df2= pd.json_normalize(list(colec.find({'founded_day': {'$lte': 7 }},
                                

{'_id':False, 'name':True, 'founded_day': True ,'acquisition.price_amount': True }).sort('acquisition.price_amount', -1).limit(10)))

df2

                name  founded_day  acquisition.price_amount
0           Netscape            4                4200000000
1             PayPal            1                1500000000
2             Zappos            1                1200000000
3            Alibaba            1                1000000000
4            Postini            2                 625000000
5             Danger            1                 500000000
6  Clearwell Systems            6                 410000000
7         PrimeSense            1                 345000000
8             Amobee            1                 321000000
9             Vitrue            1                 300000000

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [144]:
# Your Code


df2= pd.json_normalize(list(colec.find({'$and': 

                                [{'category_code': 'web'},
                                
                                {'number_of_employees': {'$gt': 4000 }}]},
                                

{'_id':False, 'name':True, 'category_code': True ,'number_of_employees': True }).sort('number_of_employees', 1).limit(10)))

df2

                            name category_code  number_of_employees
0                        Expedia           web                 4400
1                            AOL           web                 8000
2                        Webkinz           web                 8657
3                        Rakuten           web                10000
4  Los Angeles Times Media Group           web                10000
5                        Groupon           web                10000
6                         Yahoo!           web                13600
7                           eBay           web                15000
8                       Experian           web                15500

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [145]:
# Your Code


df2= pd.json_normalize(list(colec.find({'$and': 

                                [{'acquisition.price_amount':{'$gte': 1e7}},
                                
                                {'acquisition.price_currency_code': 'EUR'}]},
                                

{'_id':False, 'name':True, 'acquisition.price_amount': True ,'acquisition.price_currency_code': True }).limit(10)))

df2

,name,acquisition.price_amount,acquisition.price_currency_code
0,ZYB,31500000,EUR
1,Apertio,140000000,EUR
2,Greenfield Online,40000000,EUR
3,Webedia,70000000,EUR
4,Wayfinder,24000000,EUR
5,Tuenti Technologies,70000000,EUR
6,BioMed Central,43400000,EUR

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [149]:
# Your Code

df2= pd.json_normalize(list(colec.find(

                                {'acquisition.acquired_month':{'$lte': 4}},
                        
                                

{'_id':False, 'name':True, 'acquisition.price_amount': True ,'acquisition.acquired_month': True }).limit(10)))

df2

              name  acquisition.price_amount  acquisition.acquired_month
0      StumbleUpon                29000000.0                           4
1             Kyte                       NaN                           1
2             Veoh                       NaN                           4
3  Jingle Networks                62500000.0                           4
4       NetRatings               327000000.0                           2
5           blogTV                       NaN                           3
6       Livestream                       NaN                           1
7        delicious                       NaN                           4
8          Jobster                       NaN                           4
9            Spock                       NaN                           4

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [151]:
# Your Code


df2= pd.json_normalize(list(colec.find({'$and': 

                                [{'founded_year':{'$gte': 2000}},

                                {'founded_year':{'$lte': 2010}},
                                
                                {'founded_year': {'$ne': 2011}}]},
                                

{'_id':False, 'name':True, 'acquisition.price_amount': True ,'founded_year': True }).limit(10)))

df2

          name  founded_year  acquisition.price_amount
0     Wetpaint          2005                30000000.0
1         Zoho          2005                       NaN
2         Digg          2004                  500000.0
3     Facebook          2004                       NaN
4    Omnidrive          2005                       NaN
5         Geni          2006                       NaN
6      Twitter          2006                       NaN
7  StumbleUpon          2002                29000000.0
8       Gizmoz          2003                       NaN
9       Scribd          2007                       NaN

### 20. All the companies that have been 'deadpooled' after the third year.

In [ ]:
# Your Code